{
  "blogs": [
    {
      "title": "What is programming?",
      "body": "Hi, welcome to programming! If you've never learned to program before, you might be wondering what programming actually is. Well, when we write a program, we're giving the computer a series of commands that kind of look like a weird form of English. You can think of a computer as a very obedient dog, listening to your every command, and doing whatever you tell it to do. So what's so cool about programming? Well, it really depends on what you think is cool. Because as it turns out, you can use programming for almost everything. Programs control robots that can take care of patients, and my favorite, robots that can roam around Mars and look for water on the surface. Programs help self-driving cars know which way to turn-- which is pretty important! Programs help doctors cure diseases by processing huge amounts of medical data. Programs can be really fun games, like Doodle Jump, Angry Birds, Minecraft. Programs make it possible for Pixar to put out their awesome 3-D animated movies, and for movies like Harry Potter to have such cool special effects. What's your favorite movie? I bet that a computer helped make it somehow. Programs are behind the websites and the apps that you use every day, all the time, like Google Maps, and Wikipedia, and YouTube, and of course, where you are now, Khan Academy. Here, on Khan Academy, you'll learn how to write JavaScript programs to make drawings, animations, and games. And that will be a great start towards creating whatever you're imagining in your head. I know, it might be hard to see how a drawing program relates to programs for robots, or curing diseases. But believe it or not, the same basic concepts are used by pretty much every programmer in every program. Once you learn to program JavaScript, you'll be able to learn other programming languages much more easily. Now you just gotta keep going!",
      "author": "Hazim",
      "id": 5
    },
    {
      "title": "Understanding Cryptocurrencies",
      "body": "Cryptocurrencies are digital or virtual currencies underpinned by cryptographic systems. They enable secure online payments without the use of third-party intermediaries. \"Crypto\" refers to the various encryption algorithms and cryptographic techniques that safeguard these entries, such as elliptical curve encryption, public-private key pairs, and hashing functions.\n\nCryptocurrencies can be mined or purchased from cryptocurrency exchanges. Not all ecommerce sites allow purchases using cryptocurrencies. In fact, cryptocurrencies, even popular ones like Bitcoin, are hardly used for retail transactions. However, the skyrocketing value of cryptocurrencies has made them popular as trading instruments. To a limited extent, they are also used for cross-border transfers.\n\nCentral to the appeal and functionality of Bitcoin and other cryptocurrencies is blockchain technology. As its name indicates, blockchain is essentially a set of connected blocks or an online ledger. Each block contains a set of transactions that have been independently verified by each member of the network. Every new block generated must be verified by each node before being confirmed, making it almost impossible to forge transaction histories.1The contents of the online ledger must be agreed upon by the entire network of an individual node, or computer maintaining a copy of the ledger.",
      "author": "Hazim",
      "id": 6
    },
    {
      "title": "History of pharmacy",
      "body": "The beginnings of pharmacy are ancient. When the first person expressed juice from a succulent leaf to apply to a wound, this art was being practiced. In the Greek legend, Asclepius, the god of the healing art, delegated to Hygieia the duty of compounding his remedies. She was his apothecary or pharmacist. The physician-priests of Egypt were divided into two classes: those who visited the sick and those who remained in the temple and prepared remedies for the patients.\n\nIn ancient Greece and Rome and during the Middle Ages in Europe, the art of healing recognized a separation between the duties of the physician and those of the herbalist, who supplied the physician with the raw materials from which to make medicines. The Arabian influence in Europe during the 8th century AD, however, brought about the practice of separate duties for the pharmacist and physician. The trend toward specialization was later reinforced by a law enacted by the city council of Bruges in 1683, forbidding physicians to prepare medications for their patients. In America, Benjamin Franklin took a pivotal step in keeping the two professions separate when he appointed an apothecary to the Pennsylvania Hospital.\n\nThe development of the pharmaceutical industry since World War II led to the discovery and use of new and effective drug substances. It also changed the role of the pharmacist. The scope for extemporaneous compounding of medicines was much diminished and with it the need for the manipulative skills that were previously applied by the pharmacist to the preparation of bougies, cachets, pills, plasters, and potions. The pharmacist continues, however, to fulfill the prescriber’s intentions by providing advice and information; by formulating, storing, and providing correct dosage forms; and by assuring the efficacy and quality of the dispensed or supplied medicinal product.",
      "author": "Ali",
      "id": 7
    }
  ]
}